title: ESXi VIB Acceptance Level Set to Community Supported via ESXCLI
id: c821828c-e57b-48fc-995d-080bd8615c6d
status: experimental
description: Detects when the VIB host acceptance level is set to CommunitySupported.
references:
    - https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_software.html
    - https://lolesxi-project.github.io/LOLESXi/lolesxi/Binaries/esxcli/
author: Nathan Burns
date: 2025-01-13
tags:
    - attack.t1562.001 
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: '/esxcli'
        CommandLine|contains|all:
            - 'software'
            - 'acceptance'
            - 'set'
            - '--level'
            - 'CommunitySupported'
    condition: all of selection_*
falsepositives:
    - Legitimate system administration actions
level: high
testing_command: 'esxi-testing-toolkit host unrestrict-vib-acceptance-level --verbose'