title: ESXi System Network Information Enumerated via ESXCLI
id: 3e1b0a17-be19-445c-9a44-1bfe4111c3d9
status: experimental
description: Detects when ESXCLI is used to enumerate network information on an ESXi host.
references:
    - https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_network.html
    - https://lolesxi-project.github.io/LOLESXi/lolesxi/Binaries/esxcli/
author: Nathan Burns
date: 2025-01-13
tags:
    - attack.t1082
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: '/esxcli'
    selection_cmd:
        CommandLine|contains:
            - 'network'
            - 'ip'
            - 'interface'
            - 'get'
            - 'list'
    condition: all of selection_*
falsepositives:
    - Legitimate system administration actions
level: low

testing_command: 'esxi-testing-toolkit host get-network-information --verbose'